ViperCobraNaja/Viper-crate-system/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_SPIRAM=y
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=n
CONFIG_FATFS_USE_FASTSEEK=y
CONFIG_FATFS_ALLOC_PREFER_ALIGNED_WORK_BUFFERS=y
CONFIG_FATFS_IMMEDIATE_FSYNC=n
CONFIG_FATFS_PER_FILE_CACHE=y
CONFIG_FREERTOS_HZ=1000
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_MIPI_RAW10_1920X1080_30FPS=y
CONFIG_CAMERA_OV5647_MIPI_RAW8_800X800_50FPS=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW8_800X800_50FPS=y
CONFIG_LVGL_PORT_ENABLE_PPA=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=10
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# -------- WiFi Remote (板载 C6, SDIO) --------
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_WIFI_RMT_ENTERPRISE_SUPPORT=y
CONFIG_ESP_WIFI_REMOTE_EAP_ENABLED=y
CONFIG_WIFI_RMT_SOFTAP_SUPPORT=y
CONFIG_WIFI_RMT_NVS_ENABLED=y

# VFS/lwIP 扩容 — WiFi 配网需要
CONFIG_VFS_MAX_COUNT=16
CONFIG_LWIP_MAX_SOCKETS=16
